Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །སྐོར་བར་འགྱུར་རོ། །དེ་ལྟ་ལགས་པས། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་འཚལ་བས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱིའོ།
en: Blessed Lord, since this is the case, bodhisattva great beings who seek to transcend all phenomena should continue to engage with the perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པ་དེ་དག་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བགྱི་བ་ལགས་སོ།
en: Blessed Lord, bodhisattva great beings who practice this perfection of wisdom are paid homage by the world with its gods, humans, and asuras.”

source: །དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཐམས་ཅད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་དེ་དེ་བཞིན་ནོ།
en: The Blessed One then addressed all those great śrāvakas and all those bodhisattva great beings: “O noble children, it is so!

source: །དེ་དེ་བཞིན་ཏེ།
en: It is so!

source: ཇི་སྐད་དུ་སྨྲས་པ་བཞིན་ནོ།
en: It is just as you have said!

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པ་དེ་དག་ནི། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཕྱག་བྱ་བར་འོས་པའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་ན།
en: Those bodhisattva great beings who practice this perfection of wisdom deserve the homage of the world with its gods, humans, and asuras.

source: མིའི་འཇིག་རྟེན་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །ལྷའི་འཇིག་རྟེན་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་། བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་། ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སུམ་ཅུ་རྩ་གསུམ་པ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: If you ask why, it is when bodhisattva great beings are to be found that the world of humans arises in the world, that the world of gods arises in the world, that the world of asuras arises in the world, that great and lofty royal families, that great and lofty priestly families, that great and lofty householder families, and that imperial monarchs, the gods of Caturmahā­rāja­kāyika, and the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha all arise in the world. {

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་ན། བཟའ་བ་དང་། བཏུང་བ་དང་། བཞོན་པ་དང་།
en: Dt.95} “[It is when bodhisattva great beings are to be found] that those entering the stream to nirvāṇa, those destined for only one more rebirth, those who will no longer be reborn, those who are arhats, and those who are pratyekabuddhas all arise in the world, and indeed that bodhisattva great beings and the tathāgatas, arhats, completely awakened buddhas all arise in the world. “

source: གོས་དང་། མལ་ཆ་དང་། ཁྱིམ་དང་འཚོ་བ་དང་ནོར་བུ་དང་མུ་ཏིག་དང་དུང་དང་མན་ཤེལ་དང་། བྱི་རུ་དང་གསེར་དང་། དངུལ་དག་ཀྱང་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: Noble children, it is when bodhisattva great beings are to be found that food, drink, vehicles, clothing, bedding, houses, sustenance, jewels, pearls, conch, quartz, coral, gold, and silver also arise in the world. “

source: །རིགས་ཀྱི་བུ་དག་སེམས་ཅན་རྣམས་ཀྱི་བདེ་བའི་ཡོ་བྱད་མིའི་རྐྱེན་དང་། ལྷ་རྫས་སུ་བྱ་བ་འམ་ཡང་དག་པར་བྲལ་བའི་བདེ་བའང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་ན་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: Noble children, any necessities that bring happiness to beings, be they the conditions that benefit human beings, the sacraments of the gods, or indeed anything that brings happiness devoid of [mundane pursuits]—all these, too, arise in the world when there are bodhisattva great beings to be found.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཏེ།
en: If you ask why, O noble children, when bodhisattva great beings practice the conduct of a bodhisattva, they dwell in the six perfections.

source: བདག་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་གཞན་ཡང་སྦྱིན་པ་ལ་སྦྱོར་རོ།
en: They themselves practice generosity and they also unite others in generosity.

source: །བདག་ཚུལ་ཁྲིམས་སྲུང་ཞིང་གཞན་ཡང་ཚུལ་ཁྲིམས་ལ་སྦྱོར་རོ།
en: They themselves maintain ethical discipline and they also unite others in ethical discipline.

source: བདག་བཟོད་པ་སྒོམ་ཞིང་གཞན་ཡང་བཟོད་པ་ལ་སྦྱོར་རོ།
en: They themselves cultivate tolerance and they also unite others in tolerance.

source: །བདག་བརྩོན་འགྲུས་རྩོམ་ཞིང་གཞན་ཡང་བརྩོན་འགྲུས་ལ་སྦྱོར་རོ།
en: They themselves undertake perseverance and they also unite others in perseverance.

source: །བདག་བསམ་གཏན་སྐྱེད་ཅིང་གཞན་ཡང་བསམ་གཏན་ལ་སྦྱོར་རོ།
en: They themselves develop meditative concentration, and they also unite others in meditative concentration.

source: །བདག་ཤེས་རབ་སྒོམ་ཞིང་གཞན་ཡང་ཤེས་རབ་སྒོམ་པ་ལ་སྦྱོར་རོ།
en: They themselves cultivate wisdom, and they also unite others in the cultivation of wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་རྟེན་ཅིང་སེམས་ཅན་རྣམས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་དེ།
en: Dependent on bodhisattva great beings, beings practice the six perfections.

source: དེ་དག་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པས། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་འཐོབ་པོ།
en: Through practicing the six perfections, they will attain all mundane and supramundane excellences.

source: །རིགས་ཀྱི་བུ་དག་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་དོན་དུ་ཞུགས་པ་ཡིན་ནོ།
en: So it is, noble children, that bodhisattva great beings engage [in the world] for the benefit and happiness of all beings.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཞལ་གྱི་སྒོ་ནས་ལྗགས་ཀྱི་དབང་པོ་བཀྲམ་སྟེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཁྱབ་པར་མཛད་དོ།
en: Thereupon the Blessed One extended his tongue from his mouth, covering this great trichiliocosm.

source: །དེ་ནས་དེའི་ཚེ་ལྗགས་ཀྱི་དབང་པོ་དེ་ལས་འོད་འཕྲོ་བ་ཁ་དོག་དུ་མ་དང་ཁ་དོག་སྣ་ཚོགས་སུ་ལྡན་པ་མང་པོ་བྱུང་བར་གྱུར་ཏོ། །དེ་བྱུང་ནས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་རྒྱས་པར་གྱུར་ཏོ།
en: Manifold lights of many diverse colors emanated from his tongue, and, having emanated, they permeated the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, with great luminosity. {

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་། འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྣང་བ་ཆེན་པོས་རྒྱས་པར་གྱུར་ཏོ།
en: Dt.96} They permeated the world systems of each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, with great luminosity.

source: །དེ་ནས་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་དེ་དག་གི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་གིས་འོད་རྣམ་པར་ཕྱེ་བ་དེ་མཐོང་ནས། རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་ཏེ། བཅོམ་ལྡན་འདས་འདི་ལྟར་འཇིག་རྟེན་གྱི་ཁམས་འདི་དག་སྣང་བ་ཆེན་པོས་བལྟམ་པ་འདི་སུའི་མཐུ་ལགས་ཞེས་ཡོངས་སུ་དྲིས་སོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བཀའ་སྩལ་པ།
en: Then, when the bodhisattva great beings of those world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, had seen that well-distinguished light, they asked the lord buddhas of their respective buddhafields, “Blessed Lord, whose power is this that causes these world systems to be manifested with great light in this manner?”

source: རིགས་ཀྱི་བུ་དག་འདི་ནས་ནུབ་ཕྱོགས་ལོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: Those lord buddhas replied, “Noble children, in the western direction from here, there is a world system called Patient Endurance.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: There, the tathāgata, arhat, completely awakened buddha named Śākyamuni resides.

source: དེས་ཞལ་གྱི་སྒོ་ནས་ལྗགས་ཀྱི་དབང་པོ་བཀྲམ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པའི་ཕྱིར། འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་འདི་དག་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་མཛད་དོ།
en: Extending his tongue from his mouth, he has suffused these world systems [of the eastern direction], numerous as the grains of sand of the river Gaṅgā, with great light in order to reveal the perfection of wisdom to bodhisattva great beings.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པའི་ཕྱིར། ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེའི་བར་དུ་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་པོ་འདི་དག་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་མཛད་དོ།
en: He has suffused all the other world systems, up to and including those of each of the ten directions, with great light in order to reveal the perfection of wisdom to bodhisattva great beings.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་ན་བདག་ཅག་ཀྱང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་བལྟ་བ་དང་དེ་ལ་ཕྱག་བགྱི་བ་དང་བསྙེན་བཀུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་བཅུ་ནས་འདུས་པ་དེ་དག་ཀྱང་བལྟ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ཡང་མཉན་པའི་སླད་དུ་མཆིའོ།
en: Then those bodhisattva great beings asked those lord buddhas, “Blessed Lord, since that is the case, we too should go to see that tathāgata, arhat, completely awakened Buddha Śākyamuni, to pay homage to him and venerate him, and also to see those bodhisattva great beings who have assembled from the ten directions, and, indeed, to listen to the perfection of wisdom.”

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་དེང་ཤིག །
en: The lord buddhas replied, “Noble children, you may proceed since I know that it is timely.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ལན་བདུན་དུ་གཡས་ཕྱོགས་ནས་བསྐོར་བ་བྱས་ཏེ།
en: Those bodhisattva great beings then bowed their heads toward the feet of the tathāgatas, arhats, completely awakened buddhas, and circumambulated them from the right seven times.

source: ཕྱོགས་བཅུ་ནས་གདུགས་དང་རྒྱལ་མཚན་དང་ལྷའི་བ་དན་དང་། མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་བདུག་པ་དང་། ཕྱེ་མ་དང་ན་བཟའ་དང་གསེར་གྱི་མེ་ཏོག་དང་དངུལ་གྱི་མེ་ཏོག་ལ་སོགས་པ་རྣམ་པ་དུ་མ་ཁྱེར་ཏེ། གླུ་དང་རོལ་མོ་བརྡུང་བ་དང་དཀྲོལ་བ་མང་པོས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་གང་ན་བ་དེར་འདོང་ངོ་། །དེ་ནས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། གནས་གཙང་མ་པ་ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱང་ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། བདུག་པ་དང་། ཕྱེ་མ་དང་།
en: From the ten directions they brought many parasols, victory banners, divine ribbons, flowers, garlands, perfumes, unguents, incense, powders, robes, golden flowers, silver flowers, and so forth, and approached the place where the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, was seated, while singing songs and beating and ringing their musical instruments.

source: ལྷ་རྫས་ཀྱི་མེ་ཏོག་ཨུཏྤལ་དང་། པད་མོ་དང་། ཀུ་མུད་དང་། བུན་ད་རི་ཀ་དང་། ལྷ་རྫས་ཀྱི་མེ་ཏོག་མན་དཱ་ར་བ་དང་མན་དཱ་ར་བ་ཆེན་པོ་དང་།
en: Then the gods of Caturmahā­rāja­kāyika, and the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, and the Pure Abodes of Avṛha, Atapa, Sudṛśa, Sudarśana, {Dt.97} and Akaniṣṭha also brought many divine flowers, garlands, perfumes, unguents, incense, powders, divine blue lotuses, day lotuses, night lotuses, white lotuses, divine coral flowers, large coral flowers, crocuses, and mangosteen leaves, and set out for the place where the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni, was seated.

source: ཀེ་ས་ར་དང་ཏ་མ་ལའི་ལོ་མ་མང་པོ་ཁྱེར་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་གང་ན་བ་དེར་དོང་སྟེ། དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ལྷ་དེ་དག་གིས་མེ་ཏོག་དང་ཕྲེང་བ་དང་སྤོས་དང་བྱུག་པ་དང་བདུག་པ་དང་ཕྱེ་མ་དང་ན་བཟའ་དང་གདུགས་དང་རྒྱལ་མཚན་དང་ལྷའི་བ་དན་དེ་དག་གིས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ལ་གཏོར་ཏོ།
en: There those bodhisattva great beings and those gods scattered and showered those flowers, garlands, perfumes, unguents, incense, powders, robes, parasols, victory banners, and divine ribbons upon the Blessed One, the tathāgata, arhat, completely awakened Buddha Śākyamuni.

source: །མངོན་པར་གཏོར་ཏོ། །དེ་ནས་མེ་ཏོག་ལ་སོགས་པ་དེ་དག་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་སྟེང་གི་ནམ་མཁའ་ལ་མངོན་པར་འཕགས་ཏེ། མེ་ཏོག་གི་ཁང་པ་བརྩེགས་པ། གྲུ་བཞི་ཀ་བ་བཞི་དང་ལྡན་པ། ཆ་ཀུན་དུ་མཉམ་པ།
en: Their offerings then ascended into the sky above this great trichiliocosm, forming a towering mansion of flowers, square in shape, with four pillars, well proportioned, excellently distinguished, delightful, and pleasant.

source: ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། མདངས་དགའ་ཞིང་ཡིད་དུ་འོང་བར་རེད་དེ་འདུག་གོ །དེ་ནས་འཁོར་དེའི་ནང་ནས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པོ།
en: Thereupon, within that assembly, many hundred billion trillion living beings attained acceptance of the nonarising nature of phenomena.

source: །དེ་ནས་དེ་དག་སྟན་ལས་ལངས་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ཐལ་མོ་སྦྱར་བས་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་མ་འོངས་པའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་གང་བརྙེས་པར་གྱུར་པའི་ཆོས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་ཐམས་ཅད་ཐོབ་པར་གྱུར་ཏེ།
en: Standing up from their seats, with their hands placed together, they bowed toward the place where the Blessed One was seated, and made the following aspiration in the presence of the Blessed One: “Blessed Lord, in the future, we too will obtain all aspects of the Dharma such as these that the tathāgata, arhat, completely awakened Buddha has obtained.

source: ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་འདི་ལྟ་བུ་ཡོངས་སུ་བསྡུ་བར་བགྱིའོ།
en: We will convene a saṅgha of śrāvakas such as this.

source: །ད་ལྟར་འདིར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཇི་ལྟར་བསྟན་པ་དེ་བཞིན་དུ། འཁོར་འདི་དང་འདྲ་བར་ནི་ཆོས་བསྟན་པར་བགྱིའོ། །ཞེས་སྨོན་ལམ་བཏབ་པོ།
en: We will teach the Dharma in an assembly like this, just as the Tathāgata is demonstrating the Dharma here at the present time.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་བུ་དེ་དག་གི་བསམ་པ་ཐུགས་སུ་ཆུད་དེ། ཆོས་ཐམས་ཅད་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་ལ་བཟོད་པར་གྱུར་པ་མཁྱེན་ནས་ཞལ་འཛུམ་པ་མཛད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ།
en: The Blessed One understood the wishes of those noble children, and, knowing that they would become receptive to [the truth that] all phenomena are nonarising, unceasing, unconditioned, and unoriginated, he smiled.

source: བླ་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་ཐལ་མོ་སྦྱར་བས་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་རྒྱུ་དང་རྐྱེན་མ་མཆིས་པར་བཞད་པ་མི་མཛད་ན། ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་གྱིས་ཞལ་འཛུམ་པ་མཛད།
en: Thereupon, the venerable Ānanda, rising from his seat, with his upper robe over one shoulder, {Dt.98} rested his right knee on the ground, and, placing his hands together in the gesture of homage, bowed toward the Blessed One, and asked, “Blessed Lord, since the tathāgatas, arhats, completely awakened buddhas do not smile without reason and circumstances, what is the reason and what are the circumstances for your smile?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་འཁོར་འདིའི་ནང་ནས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: The Blessed One replied, “Ānanda, a hundred billion trillion living beings in this assembly will attain acceptance of the nonarising nature of phenomena.

source: །དེ་དག་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ན་བསྐལ་པ་མེ་ཏོག་གི་འབྱུང་གནས་ཞེས་བྱ་བ་ལ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་མེ་ཏོག་ཅེས་བྱ་བ་ཤ་སྟག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: In the future, when sixty-eight million trillion eons have passed, during the eon called Puṣpākara, they will all become manifest in the world as tathāgatas, arhats, completely awakened buddhas named Abhibodhyaṅga­puṣpa.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ཤཱ་རིའི་བུའི་ལེའུ་སྟེ་གཉིས་པའོ།། །།
en: This completes the second chapter, “Śāriputra,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཀའ་སྩལ་པ། རབ་འབྱོར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་རྩོམ་སྟེ། ཅི་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་ཀྱི་གཏམ་བྱ་བར་སྤོབས་པ་སྐྱེད་ཅིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་།
en: Chapter 3 Then the Blessed One addressed the venerable Subhūti: “Subhūti, commencing with the perfection of wisdom, you should be inspired to tell bodhisattva great beings how bodhisattva great beings will become emancipated in the perfection of wisdom!”

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ལྷའི་བུ་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འདི་རང་གི་ཤེས་རབ་དང་སྤོབས་པ་ཙམ་གྱི་སྟོབས་དང་ཤུགས་ཀྱི་གོ་ཅས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོན་ཏམ། འོན་ཏེ་སངས་རྒྱས་ཀྱི་མཐུས་སྟོན་པར་འགྱུར་སྙམ་པ་དང་། དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: Thereupon, those bodhisattva great beings, those great śrāvakas, and those gods who were present thought, “Will this venerable Subhūti teach the perfection of wisdom to these bodhisattva great beings through the armor of the strength and force just of his own wisdom and inspired speech, or will he teach it through the power of the Buddha?”

source: སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། ལྷའི་བུ་དེ་དག་གི་སེམས་ཀྱི་ཀུན་ཏུ་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་རྣམས་ནི་གང་ཅི་སྨྲ་ཡང་རུང་།
en: Through the power of the Buddha, the venerable Subhūti knew in his own mind the thoughts in the minds of those bodhisattva great beings, those śrāvakas, and those gods, and he said to the venerable Śāradvatīputra, “Venerable Śāradvatīputra, whatever the śrāvakas of the Blessed One say, whatever they teach, whatever they expound, it is the power of the Tathāgata.

source: གང་ཅི་སྟོན་ཀྱང་རུང་། གང་ཅི་རྗོད་ཀྱང་རུང་སྟེ། དེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་མཐུའོ། །དེ་བཞིན་གཤེགས་པས་ཆོས་གང་བསྟན་པ་དེ་ཐམས་ཅད་ཀྱང་ཆོས་ཉིད་དང་མི་འགལ་ལོ།
en: None of the doctrines that the Tathāgata have taught go against the nature of reality. {

source: །དེ་ལྟར་རིགས་ཀྱི་བུ་དེ་དག་ནི་ཆོས་བསྟན་པ་དེ་ལ་སློབ་ཅིང་། ཆོས་ཉིད་དེ་ལྟ་བུ་མངོན་དུ་བྱེད་དོ།
en: Dt.99} It is in this way that these noble children will train in the doctrines he teaches and actualize the nature of reality.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐབས་ཀྱིས་སྟོན་པ་མཛད་ཀྱི།
en: Śāradvatīputra, it is the Tathāgata himself who through skillful means teaches the perfection of wisdom to bodhisattva great beings.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པ་ནི། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་མ་ཡིན་ནོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: However, Venerable Śāradvatīputra, this teaching of the perfection of wisdom to bodhisattva great beings is not within the capacity of any śrāvakas or pratyekabuddhas.”

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་ན། འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བའམ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བགྱི་བ་འདི་ཆོས་གང་གི་ཚིག་བླ་དགས་ལགས།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, you have spoken of ‘bodhisattvas, bodhisattvas,’ yet what is it that has the designation bodhisattva or perfection of wisdom?

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བའམ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བགྱི་བ་དེ་ལྟ་བུ་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་། །བཅོམ་ལྡན་འདས་དེ་ལྟར་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་དང་།
en: Blessed Lord, I do not observe any such thing that is called ‘bodhisattva’ or ‘perfection of wisdom.’

source: བྱང་ཆུབ་སེམས་དཔའི་མིང་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སུ་ཞིག །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་གང་ཞིག་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱི། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Blessed Lord, since I do not observe such a ‘bodhisattva,’ such a ‘perfection of wisdom,’ or even such a term as ‘bodhisattva,’ what bodhisattva great being should I instruct and teach, and in what perfection of wisdom?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མིང་དུ་བྱ་བ་དེ་དག་ནི་མིང་ཙམ་སྟེ།
en: The Blessed One replied to the venerable Subhūti, “Subhūti, it is like this: the perfection of wisdom, a bodhisattva, and the term ‘bodhisattva’ are all just names.

source: མིང་དེ་ནི་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ།
en: Those names do not exist inside, do not exist outside, and cannot be apprehended as neither of the two. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སེམས་ཅན་སེམས་ཅན་ཞེས་བྱ་བར་མིང་དུ་གདགས་པའི་མིང་དེ་ནི་བཏགས་པ་ཙམ་སྟེ།
en: Subhūti, it is like this: the name used to refer to a being, for instance, is just a designation.

source: བཏགས་པའི་ཆོས་གང་ཡིན་པ་དེ་ལ་ནི། མིང་དང་བརྡ་ཙམ་དུ་ཐ་སྙད་ཀྱིས་གདགས་པ་མ་གཏོགས་པར་སྐྱེ་པ་འམ་འགག་པ་མེད་དེ།
en: Besides its assignment by convention to be a mere name or symbol, something that is a designation neither arises nor ceases.

source: མིང་དེ་ནི་ནང་ན་ཡང་མེད། ཕྱི་རོལ་ན་ཡང་མེད། གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ། །བདག་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་།
en: Those names do not exist inside, do not exist outside, and cannot be apprehended as neither of the two. “

source: སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། བྱེད་དུ་འཇུག་པ་པོ་དང་། སློང་བ་པོ་དང་། ཡོངས་སུ་སློང་བ་པོ་དང་།
en: The self, life forms, living beings, life, living creatures, individuals, human beings, people, agents, actors, petitioners, instigators, experiencers, instigators of experience, knowers, and viewers are all just designations. {

source: ཚོར་བ་པོ་དང་། ཚོར་བར་བྱེད་པ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་བཏགས་པ་ཙམ་སྟེ། བཏགས་པའི་ཆོས་གང་ཡིན་པ་དེ་ལ་ནི་མིང་དང་བརྡ་ཙམ་དུ་ཐ་སྙད་ཀྱིས་གདགས་པ་མ་གཏོགས་པར་སྐྱེ་བ་འམ་འགག་པ་མེད་དེ།
en: Dt.100} Besides their assignment by convention to be mere names or symbols, things that are designations neither arise nor cease.
